Revit 2026 API

# TransmissionData Constructor

---

Constructs a TransmissionData from another TransmissionData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TransmissionData(
	TransmissionData other
)
```
```vb
Public Sub New (
	other As TransmissionData
)
```
```cpp
public:
TransmissionData(
	TransmissionData^ other
)
```
```fsharp
new :
        other : TransmissionData -> TransmissionData
```

#### Parameters

other TransmissionData

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TransmissionData Class

Autodesk.Revit.DB Namespace